Repository: AdelZiadi/datarun-mobile
Catalog: lib/l10n/intl_*.arb
Languages: ar

# login_error_null_pass
source: لا يمكن أن تكون كلمة المرور فارغة
ar: Password cannot be null

# login_error_null_username
source: لا يمكن أن يكون اسم المستخدم فارغًا
ar: Username cannot be null

# login_error_unsuccessful_response
source: استجابة غير ناجحة من الخادم
ar: Unsuccessful response from server

# login_error_error_response
source: خطأ في معالجة الاستجابة
ar: Error processing response

# login_error_no_am_instance
source: لم يتم العثور على مثيل للخادم
ar: No server instance found

# login_error_bad_credentials
source: بيانات اعتماد غير صالحة
ar: Invalid credentials

# login_error_unknown_host
source: مضيف غير معروف
ar: Unknown host

# error_unexpected
source: حدث خطأ غير متوقع
ar: An unexpected error occurred

# error_too_manu_org_units
source: عدد كبير جدًا من الوحدات التنظيمية
ar: Too many organizational units

# error_max_tei_count_reached
source: تم الوصول إلى الحد الأقصى لعدد TEI
ar: Max TEI count reached

# error_many_requests
source: الكثير من الطلبات
ar: Too many requests

# error_already_authenticated
source: المستخدم مصادق عليه بالفعل
ar: User already authenticated

# error_already_executed
source: الإجراء تم تنفيذه بالفعل
ar: Action already executed

# error_api_invalid_query
source: استعلام API غير صالح
ar: Invalid API query

# error_app_name_not_set
source: اسم التطبيق غير مضبوط
ar: App name not set

# error_app_version_not_set
source: إصدار التطبيق غير مضبوط
ar: App version not set

# error_access_keystore
source: لا يمكن الوصول إلى مستودع المفاتيح
ar: Cannot access keystore

# error_create_existing_error
source: لا يمكن إنشاء كائن موجود بالفعل
ar: Cannot create existing object

# error_delete_non_existing_object
source: لا يمكن حذف كائن غير موجود
ar: Cannot delete non-existing object

# error_instance_keystore
source: لا يمكن إنشاء مثيل مستودع المفاتيح
ar: Cannot instantiate keystore

# error_reserve_value_on_server
source: تعذر الحجز على القيمة على الخادم
ar: Could not reserve value on server

# error_export_login
source: يرجى تسجيل الدخول للتصدير
ar: Please login to export

# error_export_encrypted
source: لا يتم دعم التصدير المشفر
ar: Encrypted export not supported

# error_import_exist
source: الاستيراد موجود بالفعل
ar: Import already exists

# error_import_logout
source: الرجاء تسجيل الخروج قبل الاستيراد
ar: Logout before import

# error_import_version
source: إصدار الاستيراد أعلى من المدعوم
ar: Import version higher than supported

# error_file_not_found
source: الملف غير موجود
ar: File not found

# error_file_resize
source: فشل تغيير حجم الصورة
ar: Failed resizing image

# error_generate_coordinate
source: تعذر إنشاء الإحداثيات
ar: Impossible to generate coordinates

# error_job
source: تقرير العمل غير متاح
ar: Job report not available

# error_low_on_available_values
source: نقص القيم المتاحة
ar: Running low on available values

# error_user_no_authenticated
source: لا يوجد مستخدم مصادق عليه
ar: No authenticated user

# error_user_no_authenticated_offline
source: لا يوجد مستخدم مصادق عليه حاليًا
ar: No authenticated user offline

# error_no_values_left_on_server
source: لا توجد قيم متبقية للحجز على الخادم
ar: Not enough values left to reserve on server

# error_different_offline_user
source: مستخدم آخر مصادق عليه بشكل غير متصل
ar: Different authenticated user offline

# error_invalid_geometry
source: قيمة هندسية غير صالحة
ar: Invalid geometry value

# error_no_reserved_values
source: لا توجد قيم محجوزة
ar: No reserved values

# error_object_update
source: لا يمكن تحديث الكائن
ar: Object cannot be updated

# error_object_insert
source: لا يمكن إدراج الكائن
ar: Object cannot be inserted

# error_ownership_access
source: تم رفض وصول الملكية
ar: Ownership access denied

# online_search_parsing_error
source: خطأ في تحليل بحث الشبكة
ar: Search grid parse error

# error_null_url
source: عنوان URL للخادم لا يمكن أن يكون فارغًا
ar: Server URL cannot be null

# error_server_malformed
source: عنوان URL للخادم غير صحيح
ar: Malformed server URL

# error_settings_app_not_supported
source: تطبيق الإعدادات غير مدعوم
ar: Settings app not supported

# error_settings_app_not_intalled
source: تطبيق الإعدادات غير مثبت
ar: Settings app not installed

# error_socket_timeout
source: انتهاء مهلة الاتصال
ar: Socket timeout

# error_relationship_updated
source: لا يمكن تحديث العلاقات
ar: Relationships cannot be updated

# error_too_many_periods
source: عدد كبير جدًا من الفترات
ar: Too many periods

# error_url_not_found
source: عنوان URL غير موجود
ar: URL not found

# error_account_disabled
source: تم تعطيل حساب المستخدم
ar: User account disabled

# error_account_locked
source: تم قفل حساب المستخدم
ar: User account locked

# error_set_value
source: لا يمكن تعيين القيمة
ar: Value cannot be set

# error_value_reservation_time
source: استغرق حجز القيم وقتًا طويلاً
ar: Values reservation took too long

# error_ssl
source: خطأ SSL
ar: SSL error

# error_sms_not_supported
source: غير مدعومة خدمة الرسائل القصيرة
ar: SMS not supported

# error_min_attributes
source: الحد الأدنى للسمات المطلوبة في البحث
ar: Minimum search attributes required

# error_org_unit_scope
source: الوحدة التنظيمية غير مشمولة في نطاق البحث
ar: Org unit not in search scope

# error_invalid_characters
source: أحرف غير صالحة
ar: Invalid characters

# not_mapped_error
source: خطأ غير معتمد
ar: Not mapped error

# app_name
source: ماس برو
ar: MASS PRO
